MikroElektronika/core_packages/RX/gcc/def/renesas/R5F566TAAGFH/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE13M : 4;
			unsigned short POE13M2 : 4;
			unsigned short PIE9 : 1;
			unsigned short POE13E : 1;
			unsigned short  : 2;
			unsigned short POE13F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE13F : 1;
			unsigned short  : 2;
			unsigned short POE13E : 1;
			unsigned short PIE9 : 1;
			unsigned short POE13M2 : 4;
			unsigned short POE13M : 4;
#endif
	} BIT;
	} ICSR9;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE14M : 4;
			unsigned short POE14M2 : 4;
			unsigned short PIE10 : 1;
			unsigned short POE14E : 1;
			unsigned short  : 2;
			unsigned short POE14F : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short POE14F : 1;
			unsigned short  : 2;
			unsigned short POE14E : 1;
			unsigned short PIE10 : 1;
			unsigned short POE14M2 : 4;
			unsigned short POE14M : 4;
#endif
	} BIT;
	} ICSR10;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE4 : 1;
			unsigned short OCE4 : 1;
			unsigned short  : 5;
			unsigned short OSF4 : 1;
#else
			unsigned short OSF4 : 1;
			unsigned short  : 5;
			unsigned short OCE4 : 1;
			unsigned short OIE4 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE5 : 1;
			unsigned short OCE5 : 1;
			unsigned short  : 5;
			unsigned short OSF5 : 1;
#else
			unsigned short OSF5 : 1;
			unsigned short  : 5;
			unsigned short OCE5 : 1;
			unsigned short OIE5 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT67ZE : 1;
			unsigned short IC1ADDMT67ZE : 1;
			unsigned short IC2ADDMT67ZE : 1;
			unsigned short IC3ADDMT67ZE : 1;
			unsigned short IC4ADDMT67ZE : 1;
			unsigned short IC5ADDMT67ZE : 1;
			unsigned short IC6ADDMT67ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDMT67ZE : 1;
			unsigned short IC9ADDMT67ZE : 1;
			unsigned short IC10ADDMT67ZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short IC10ADDMT67ZE : 1;
			unsigned short IC9ADDMT67ZE : 1;
			unsigned short IC8ADDMT67ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDMT67ZE : 1;
			unsigned short IC5ADDMT67ZE : 1;
			unsigned short IC4ADDMT67ZE : 1;
			unsigned short IC3ADDMT67ZE : 1;
			unsigned short IC2ADDMT67ZE : 1;
			unsigned short IC1ADDMT67ZE : 1;
			unsigned short CMADDMT67ZE : 1;
#endif
	} BIT;
	} POECR4B;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT23ZE : 1;
			unsigned short IC1ADDGPT23ZE : 1;
			unsigned short IC2ADDGPT23ZE : 1;
			unsigned short IC3ADDGPT23ZE : 1;
			unsigned short IC4ADDGPT23ZE : 1;
			unsigned short IC5ADDGPT23ZE : 1;
			unsigned short IC6ADDGPT23ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT23ZE : 1;
			unsigned short IC9ADDGPT23ZE : 1;
			unsigned short IC10ADDGPT23ZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short IC10ADDGPT23ZE : 1;
			unsigned short IC9ADDGPT23ZE : 1;
			unsigned short IC8ADDGPT23ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT23ZE : 1;
			unsigned short IC5ADDGPT23ZE : 1;
			unsigned short IC4ADDGPT23ZE : 1;
			unsigned short IC3ADDGPT23ZE : 1;
			unsigned short IC2ADDGPT23ZE : 1;
			unsigned short IC1ADDGPT23ZE : 1;
			unsigned short CMADDGPT23ZE : 1;
#endif
	} BIT;
	} POECR6B;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT02ZE : 1;
			unsigned short IC1ADDGPT02ZE : 1;
			unsigned short IC2ADDGPT02ZE : 1;
			unsigned short IC3ADDGPT02ZE : 1;
			unsigned short IC4ADDGPT02ZE : 1;
			unsigned short IC5ADDGPT02ZE : 1;
			unsigned short IC6ADDGPT02ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT02ZE : 1;
			unsigned short IC9ADDGPT02ZE : 1;
			unsigned short IC10ADDGPT02ZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short IC10ADDGPT02ZE : 1;
			unsigned short IC9ADDGPT02ZE : 1;
			unsigned short IC8ADDGPT02ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT02ZE : 1;
			unsigned short IC5ADDGPT02ZE : 1;
			unsigned short IC4ADDGPT02ZE : 1;
			unsigned short IC3ADDGPT02ZE : 1;
			unsigned short IC2ADDGPT02ZE : 1;
			unsigned short IC1ADDGPT02ZE : 1;
			unsigned short CMADDGPT02ZE : 1;
#endif
	} BIT;
	} POECR9;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT46ZE : 1;
			unsigned short IC1ADDGPT46ZE : 1;
			unsigned short IC2ADDGPT46ZE : 1;
			unsigned short IC3ADDGPT46ZE : 1;
			unsigned short IC4ADDGPT46ZE : 1;
			unsigned short IC5ADDGPT46ZE : 1;
			unsigned short IC6ADDGPT46ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT46ZE : 1;
			unsigned short IC9ADDGPT46ZE : 1;
			unsigned short IC10ADDGPT46ZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short IC10ADDGPT46ZE : 1;
			unsigned short IC9ADDGPT46ZE : 1;
			unsigned short IC8ADDGPT46ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT46ZE : 1;
			unsigned short IC5ADDGPT46ZE : 1;
			unsigned short IC4ADDGPT46ZE : 1;
			unsigned short IC3ADDGPT46ZE : 1;
			unsigned short IC2ADDGPT46ZE : 1;
			unsigned short IC1ADDGPT46ZE : 1;
			unsigned short CMADDGPT46ZE : 1;
#endif
	} BIT;
	} POECR10;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT79ZE : 1;
			unsigned short IC1ADDGPT79ZE : 1;
			unsigned short IC2ADDGPT79ZE : 1;
			unsigned short IC3ADDGPT79ZE : 1;
			unsigned short IC4ADDGPT79ZE : 1;
			unsigned short IC5ADDGPT79ZE : 1;
			unsigned short IC6ADDGPT79ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT79ZE : 1;
			unsigned short IC9ADDGPT79ZE : 1;
			unsigned short IC10ADDGPT79ZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short IC10ADDGPT79ZE : 1;
			unsigned short IC9ADDGPT79ZE : 1;
			unsigned short IC8ADDGPT79ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT79ZE : 1;
			unsigned short IC5ADDGPT79ZE : 1;
			unsigned short IC4ADDGPT79ZE : 1;
			unsigned short IC3ADDGPT79ZE : 1;
			unsigned short IC2ADDGPT79ZE : 1;
			unsigned short IC1ADDGPT79ZE : 1;
			unsigned short CMADDGPT79ZE : 1;
#endif
	} BIT;
	} POECR11;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX6;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX8;
	char           wk2[5];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0ASEL : 4;
			unsigned char M0BSEL : 4;
#else
			unsigned char M0BSEL : 4;
			unsigned char M0ASEL : 4;
#endif
	} BIT;
	} M0SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0CSEL : 4;
			unsigned char M0DSEL : 4;
#else
			unsigned char M0DSEL : 4;
			unsigned char M0CSEL : 4;
#endif
	} BIT;
	} M0SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M3BSEL : 4;
			unsigned char M3DSEL : 4;
#else
			unsigned char M3DSEL : 4;
			unsigned char M3BSEL : 4;
#endif
	} BIT;
	} M3SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4ASEL : 4;
			unsigned char M4CSEL : 4;
#else
			unsigned char M4CSEL : 4;
			unsigned char M4ASEL : 4;
#endif
	} BIT;
	} M4SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4BSEL : 4;
			unsigned char M4DSEL : 4;
#else
			unsigned char M4DSEL : 4;
			unsigned char M4BSEL : 4;
#endif
	} BIT;
	} M4SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M6BSEL : 4;
			unsigned char M6DSEL : 4;
#else
			unsigned char M6DSEL : 4;
			unsigned char M6BSEL : 4;
#endif
	} BIT;
	} M6SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M7ASEL : 4;
			unsigned char M7CSEL : 4;
#else
			unsigned char M7CSEL : 4;
			unsigned char M7ASEL : 4;
#endif
	} BIT;
	} M7SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M7BSEL : 4;
			unsigned char M7DSEL : 4;
#else
			unsigned char M7DSEL : 4;
			unsigned char M7BSEL : 4;
#endif
	} BIT;
	} M7SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M9ASEL : 4;
			unsigned char M9BSEL : 4;
#else
			unsigned char M9BSEL : 4;
			unsigned char M9ASEL : 4;
#endif
	} BIT;
	} M9SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M9CSEL : 4;
			unsigned char M9DSEL : 4;
#else
			unsigned char M9DSEL : 4;
			unsigned char M9CSEL : 4;
#endif
	} BIT;
	} M9SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G0ASEL : 4;
			unsigned char G0BSEL : 4;
#else
			unsigned char G0BSEL : 4;
			unsigned char G0ASEL : 4;
#endif
	} BIT;
	} G0SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G1ASEL : 4;
			unsigned char G1BSEL : 4;
#else
			unsigned char G1BSEL : 4;
			unsigned char G1ASEL : 4;
#endif
	} BIT;
	} G1SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G2ASEL : 4;
			unsigned char G2BSEL : 4;
#else
			unsigned char G2BSEL : 4;
			unsigned char G2ASEL : 4;
#endif
	} BIT;
	} G2SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G3ASEL : 4;
			unsigned char G3BSEL : 4;
#else
			unsigned char G3BSEL : 4;
			unsigned char G3ASEL : 4;
#endif
	} BIT;
	} G3SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G4ASEL : 4;
			unsigned char G4BSEL : 4;
#else
			unsigned char G4BSEL : 4;
			unsigned char G4ASEL : 4;
#endif
	} BIT;
	} G4SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G5ASEL : 4;
			unsigned char G5BSEL : 4;
#else
			unsigned char G5BSEL : 4;
			unsigned char G5ASEL : 4;
#endif
	} BIT;
	} G5SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G6ASEL : 4;
			unsigned char G6BSEL : 4;
#else
			unsigned char G6BSEL : 4;
			unsigned char G6ASEL : 4;
#endif
	} BIT;
	} G6SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G7ASEL : 4;
			unsigned char G7BSEL : 4;
#else
			unsigned char G7BSEL : 4;
			unsigned char G7ASEL : 4;
#endif
	} BIT;
	} G7SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G8ASEL : 4;
			unsigned char G8BSEL : 4;
#else
			unsigned char G8BSEL : 4;
			unsigned char G8ASEL : 4;
#endif
	} BIT;
	} G8SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G9ASEL : 4;
			unsigned char G9BSEL : 4;
#else
			unsigned char G9BSEL : 4;
			unsigned char G9ASEL : 4;
#endif
	} BIT;
	} G9SELR;
} st_poe_t;

typedef struct st_poeg {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGA;
	char           wk0[60];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPA;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRA;
	char           wk2[186];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGB;
	char           wk3[60];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPB;
	char           wk4[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRB;
	char           wk5[186];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGC;
	char           wk6[60];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPC;
	char           wk7[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRC;
	char           wk8[186];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 11;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long  : 11;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGD;
	char           wk9[60];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPD;
	char           wk10[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRD;
} st_poeg_t;

typedef struct st_port0 {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PODR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PIDR;
	char           wk2[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PMR;
	char           wk3[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char  : 1;
			unsigned char B2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char B2 : 1;
			unsigned char  : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} ODR0;
	char           wk4[63];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PCR;
	char           wk5[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} DSCR;
} st_port0_t;

typedef struct st_port1 {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
